       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTERNAL-SUBROUTINE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PRICE          PIC 9(5) VALUE 1500.
       01  WS-QUANTITY       PIC 9(3) VALUE 2.
       01  WS-AMOUNT         PIC 9(7) VALUE 0.
       PROCEDURE DIVISION.
           PERFORM CALCULATE-AMOUNT.
           PERFORM DISPLAY-RESULT.
           STOP RUN.

       CALCULATE-AMOUNT.
           COMPUTE WS-AMOUNT = WS-PRICE * WS-QUANTITY.

       DISPLAY-RESULT.
           DISPLAY "単価 = " WS-PRICE.
           DISPLAY "数量 = " WS-QUANTITY.
           DISPLAY "金額 = " WS-AMOUNT.
