       01  ORDER-RECORD.
           05 ORDER-ID        PIC 9(6).
           05 ITEM-NAME       PIC X(20).
           05 UNIT-PRICE      PIC 9(5).
           05 ORDER-QUANTITY  PIC 9(3).
           05 ORDER-AMOUNT    PIC 9(7).
           05 TAX-AMOUNT      PIC 9(7).
           05 TOTAL-AMOUNT    PIC 9(7).
