       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
           DISPLAY "Hello, COBOL!".
           DISPLAY "このプログラムは DISPLAY 文の例です。".
           STOP RUN.
