       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-UNTIL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NUMBER         PIC 9 VALUE 1.
       PROCEDURE DIVISION.
           PERFORM UNTIL WS-NUMBER > 5
              DISPLAY "NUMBER = " WS-NUMBER
              ADD 1 TO WS-NUMBER
           END-PERFORM.
           STOP RUN.
