       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCSUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01  LK-PRICE          PIC 9(5).
       01  LK-QUANTITY       PIC 9(3).
       01  LK-AMOUNT         PIC 9(7).
       PROCEDURE DIVISION USING LK-PRICE LK-QUANTITY LK-AMOUNT.
           COMPUTE LK-AMOUNT = LK-PRICE * LK-QUANTITY.
           GOBACK.
