       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXTERNAL-MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PRICE          PIC 9(5) VALUE 2500.
       01  WS-QUANTITY       PIC 9(3) VALUE 4.
       01  WS-AMOUNT         PIC 9(7) VALUE 0.
       PROCEDURE DIVISION.
           CALL "CALCSUB" USING WS-PRICE WS-QUANTITY WS-AMOUNT.
           DISPLAY "外部サブルーチン計算結果 = " WS-AMOUNT.
           STOP RUN.
